[
    {
        "cluster_id": 0,
        "level": 0,
        "community_report": null,
        "entities": [
            [
                "Retrieval-Augmented Generation",
                "Retrieval-Augmented Generation ORGANIZATION"
            ],
            [
                "RAG",
                "RAG ORGANIZATION"
            ]
        ],
        "relations": [
            [
                "Retrieval-Augmented Generation",
                "RAG",
                ", или"
            ]
        ]
    },
    {
        "cluster_id": 1,
        "level": 0,
        "community_report": null,
        "entities": [
            [
                "RAG-",
                "RAG- PRODUCT"
            ],
            [
                "студентами",
                "студентами PROFESSION"
            ],
            [
                "Аркхеме",
                "Аркхеме CITY"
            ],
            [
                "студента",
                "студента PROFESSION"
            ],
            [
                "три",
                "три NUMBER"
            ],
            [
                "трое",
                "трое NUMBER"
            ],
            [
                "студентах",
                "студентах PROFESSION"
            ],
            [
                "трех",
                "трех NUMBER"
            ]
        ],
        "relations": [
            [
                "трех",
                "RAG-",
                "студентах и бездне RAG**\n\nВ тихом университетском городке Аркхеме, где туман окутывал улицы даже в самые ясные дни, жили три студента: Элиас, скромный и мечтательный юноша с вечно задумчивым взглядом; Марго, девушка с острым умом и неутолимой жаждой знаний; и Теодор, чья страсть к технологиям граничила с одержимостью. Все трое были студентами средних способностей, но их объединяла одна цель — создать"
            ],
            [
                "трое",
                "трех",
                "студентах и бездне RAG**\n\nВ тихом университетском городке Аркхеме, где туман окутывал улицы даже в самые ясные дни, жили три студента: Элиас, скромный и мечтательный юноша с вечно задумчивым взглядом; Марго, девушка с острым умом и неутолимой жаждой знаний; и Теодор, чья страсть к технологиям граничила с одержимостью. Все"
            ],
            [
                "трех",
                "студента",
                "студентах и бездне RAG**\n\nВ тихом университетском городке Аркхеме, где туман окутывал улицы даже в самые ясные дни, жили три"
            ],
            [
                "три",
                "студента",
                ""
            ],
            [
                "студентах",
                "RAG-",
                "и бездне RAG**\n\nВ тихом университетском городке Аркхеме, где туман окутывал улицы даже в самые ясные дни, жили три студента: Элиас, скромный и мечтательный юноша с вечно задумчивым взглядом; Марго, девушка с острым умом и неутолимой жаждой знаний; и Теодор, чья страсть к технологиям граничила с одержимостью. Все трое были студентами средних способностей, но их объединяла одна цель — создать"
            ],
            [
                "студента",
                "студентами",
                ": Элиас, скромный и мечтательный юноша с вечно задумчивым взглядом; Марго, девушка с острым умом и неутолимой жаждой знаний; и Теодор, чья страсть к технологиям граничила с одержимостью. Все трое были"
            ],
            [
                "трое",
                "студента",
                ": Элиас, скромный и мечтательный юноша с вечно задумчивым взглядом; Марго, девушка с острым умом и неутолимой жаждой знаний; и Теодор, чья страсть к технологиям граничила с одержимостью. Все"
            ],
            [
                "три",
                "Аркхеме",
                ", где туман окутывал улицы даже в самые ясные дни, жили"
            ],
            [
                "Аркхеме",
                "RAG-",
                ", где туман окутывал улицы даже в самые ясные дни, жили три студента: Элиас, скромный и мечтательный юноша с вечно задумчивым взглядом; Марго, девушка с острым умом и неутолимой жаждой знаний; и Теодор, чья страсть к технологиям граничила с одержимостью. Все трое были студентами средних способностей, но их объединяла одна цель — создать"
            ],
            [
                "три",
                "RAG-",
                "студента: Элиас, скромный и мечтательный юноша с вечно задумчивым взглядом; Марго, девушка с острым умом и неутолимой жаждой знаний; и Теодор, чья страсть к технологиям граничила с одержимостью. Все трое были студентами средних способностей, но их объединяла одна цель — создать"
            ],
            [
                "три",
                "студентами",
                "студента: Элиас, скромный и мечтательный юноша с вечно задумчивым взглядом; Марго, девушка с острым умом и неутолимой жаждой знаний; и Теодор, чья страсть к технологиям граничила с одержимостью. Все трое были"
            ],
            [
                "трое",
                "Аркхеме",
                ", где туман окутывал улицы даже в самые ясные дни, жили три студента: Элиас, скромный и мечтательный юноша с вечно задумчивым взглядом; Марго, девушка с острым умом и неутолимой жаждой знаний; и Теодор, чья страсть к технологиям граничила с одержимостью. Все"
            ],
            [
                "студента",
                "Аркхеме",
                ", где туман окутывал улицы даже в самые ясные дни, жили три"
            ],
            [
                "студентах",
                "студента",
                "и бездне RAG**\n\nВ тихом университетском городке Аркхеме, где туман окутывал улицы даже в самые ясные дни, жили три"
            ],
            [
                "трех",
                "Аркхеме",
                "студентах и бездне RAG**\n\nВ тихом университетском городке"
            ],
            [
                "трех",
                "студентами",
                "студентах и бездне RAG**\n\nВ тихом университетском городке Аркхеме, где туман окутывал улицы даже в самые ясные дни, жили три студента: Элиас, скромный и мечтательный юноша с вечно задумчивым взглядом; Марго, девушка с острым умом и неутолимой жаждой знаний; и Теодор, чья страсть к технологиям граничила с одержимостью. Все трое были"
            ],
            [
                "трех",
                "студентах",
                ""
            ],
            [
                "трое",
                "RAG-",
                "были студентами средних способностей, но их объединяла одна цель — создать"
            ],
            [
                "студентами",
                "RAG-",
                "средних способностей, но их объединяла одна цель — создать"
            ],
            [
                "трое",
                "три",
                "студента: Элиас, скромный и мечтательный юноша с вечно задумчивым взглядом; Марго, девушка с острым умом и неутолимой жаждой знаний; и Теодор, чья страсть к технологиям граничила с одержимостью. Все"
            ],
            [
                "студентах",
                "студентами",
                "и бездне RAG**\n\nВ тихом университетском городке Аркхеме, где туман окутывал улицы даже в самые ясные дни, жили три студента: Элиас, скромный и мечтательный юноша с вечно задумчивым взглядом; Марго, девушка с острым умом и неутолимой жаждой знаний; и Теодор, чья страсть к технологиям граничила с одержимостью. Все трое были"
            ],
            [
                "трое",
                "студентами",
                "были"
            ],
            [
                "студента",
                "RAG-",
                ": Элиас, скромный и мечтательный юноша с вечно задумчивым взглядом; Марго, девушка с острым умом и неутолимой жаждой знаний; и Теодор, чья страсть к технологиям граничила с одержимостью. Все трое были студентами средних способностей, но их объединяла одна цель — создать"
            ],
            [
                "три",
                "студентах",
                "и бездне RAG**\n\nВ тихом университетском городке Аркхеме, где туман окутывал улицы даже в самые ясные дни, жили"
            ],
            [
                "трое",
                "студентах",
                "и бездне RAG**\n\nВ тихом университетском городке Аркхеме, где туман окутывал улицы даже в самые ясные дни, жили три студента: Элиас, скромный и мечтательный юноша с вечно задумчивым взглядом; Марго, девушка с острым умом и неутолимой жаждой знаний; и Теодор, чья страсть к технологиям граничила с одержимостью. Все"
            ],
            [
                "студентах",
                "Аркхеме",
                "и бездне RAG**\n\nВ тихом университетском городке"
            ],
            [
                "Аркхеме",
                "студентами",
                ", где туман окутывал улицы даже в самые ясные дни, жили три студента: Элиас, скромный и мечтательный юноша с вечно задумчивым взглядом; Марго, девушка с острым умом и неутолимой жаждой знаний; и Теодор, чья страсть к технологиям граничила с одержимостью. Все трое были"
            ],
            [
                "три",
                "трех",
                "студентах и бездне RAG**\n\nВ тихом университетском городке Аркхеме, где туман окутывал улицы даже в самые ясные дни, жили"
            ]
        ]
    },
    {
        "cluster_id": 2,
        "level": 0,
        "community_report": null,
        "entities": [
            [
                "Элиасом",
                "Элиасом PERSON"
            ],
            [
                "ситетского",
                "ситетского FACILITY"
            ]
        ],
        "relations": [
            [
                "Элиасом",
                "ситетского",
                "здания. Их лаборатория была завалена книгами, схемами и странными устройствами, которые Теодор называл \"прототипами\". На столе лежал древний фолиант, найденный"
            ]
        ]
    }
]